#capitalize()
#string.capitalize()
#Перетворює рядок так, що перша буква переводиться у верхній регістр, а решта — у нижній.
slova = 'ПрИвІт ДрУжЕ!'
print(slova.capitalize())
dragon = 'мІй дрАКОН ЗЕЛений. ЦЕ міЙ Друг\nце стВОРІння ЖИВЕ поряд ЗІ МНОю.'
print(dragon.capitalize())
#цей метод типу даних str корисний тим, що як би користувач не вводив слово, під капсом або ще якось, весь рядок буде мати літери малого регістру окрім першої
experement = input('Напиши будь яке слово/речення')
print(experement.capitalize())