print('|--------------------|')
print('|вітаю на початку гри|')
print('|--------------------|')
vubir1 = input('Ти ідеш додому (вдома нікого немає). Надворі прохолодно і капає дощ. Попри дорогу ти бачиш кошеня, яке дрімає, скрутившись у калачик.\n Ваші дії:\n 1-приютити кошеня  2-пройти мимо')
if vubir1 == '1':
    print('Ви підібрали кошеня і пішли з ним додому')
    vubir2 = input('Дойшовши додому ви вирішили нагодувати кошеня.\n Чим ти його нагодуєш?\n 1-смажене зі спеціями м ясо яке було вдома 2-підеш в магазин біля дому і купиш пакетик корму для кошеняти')
    if vubir2 == '1':
        print('котам не можна спеції! Кошеняті погано')
        vubir3 = input('що ви виберете:\n 1-завести кошеня у ветеренарню 2-надіятися, що все минеться ')
        if vubir3 == '1':
            print('Ветеренар дав кошеняті ліки і йому кращає')
            vubir4 = input('Через декілька днів кошеня одужало. У вас є вибір: 1-залишити кошеня у себе 2-віддати у добрі руки')
            if vubir4 == '1':
                print('Кошеня залишилося у вас і прожило ще дуже довго :)')
                print('GAME OVER')
            elif vubir4 == '2':
                print('Ви віддаєте кошеня у добрі руки')
                print('GAME OVER')

        elif vubir3 == '2':
            print('Кошеняті не покращало.\n У вас більше немає кошеня')
            print('GAME OVER')
    elif vubir2 == '2':
        print('Ви купили у магазині корм і нагодували його')
        vubir4 = input('у вас є вибір: 1-залишити кошеня у себе 2-віддати у добрі руки')
else:
    print('Ви пройшли мимо і дойшли додому')
    print('game over')


