#user = input('введіть пароль')
#parol = 'p12345a'
#if parol != user:
#    print('доступ заблоковано')
#else:
#    print('доступ дозволено')
#----------------------------------------------------------

print('привіт. давай пограємо у гру. я задаватиму питання, а ти відповідатимеш ;)')

score = 0

#score = 0 - початкова к-сть балів, яка змінюватиметься
#.strip().lower() - забирає пробіли і робить букви маленькі
#score += 1 - додає 1 бал за правильну відповідь.

answer1 = input("Який день настає після понеділка?")
if answer1.strip().lower() == "вівторок":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: вівторок")


answer2 = input("хто автор книги коти-вояки? (Напиши повністю ім'я і прізвище автора/авторки)")
if answer2.strip().lower() == "ерін гантер":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: ерін гантер")


answer3 = input("Чи бувають чорні коти?")
if answer3.strip().lower() == "так":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: так")


answer4 = input("Скільки ніг у павука? ")
if answer4.strip() == "8":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: 8")


answer5 = input("Як називається найвища гора у світі? ")
if answer5.strip().lower() == "джомолунгма" or "еверест":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: джомолунгма або еверест")


answer6 = input("Яка планета найближча до Сонця? ")
if answer6.strip().lower() == "меркурій":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Меркурій")


answer7 = input("Хто написав 'Кобзар'? (Напиши повністю ім'я і прізвище автора/авторки ")
if answer7.strip().lower() == "тарас шевченко":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Тарас Шевченко")


answer8 = input("Який колір утворюється при змішуванні синього і жовтого? ")
if answer8.strip().lower() == "зелений":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Зелений")


answer9 = input("Який найбільший океан на Землі? ")
if answer9.strip().lower() == "тихий":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Тихий")


answer10 = input("Скільки буде 5 помножити на 6? ")
if answer10.strip() == "30":
    print("Правильно!!!")
    score += 1
else:
    print("Неправильно! Правильна відповідь: 30")


print("Твій загальний результат:", score, "з 10.")
if score <=5:
    print("всі допускають помилки")
else:
    print("Молодець")