while True:

    try:


        c = input('введи валюту, яку хочеш конвертувати: євро/гривні/долар./ВИЙТИ\n').lower()

        if c == 'гривні':
            k = input('введи у яку валюту ви хочете конвертувати гривні (євро 💶/долар 💵)\n').lower()
            t = int(input('введи суму гривень для конвертації 🤑\n'))

            if k == 'євро':
                i = (t / 47.59)
                print(f'{i} євро')

            elif k == 'долар':
                a = (t / 41.65)
                print(f'{a} доларів')

            else:
                print('я не знаю таку валюту 🫣')

        elif c == 'євро':
            k2 = input('введи у яку валюту ви хочете конвертувати євро (гривні 💶/долар 💵)\n').lower()
            t2 = int(input('введи суму євро для конвертації 🤑\n'))
            if k2 == 'гривні':
                i2 = (t2 * 47.59)
                print(f'{i2} гривень')

            elif k2 == 'долар':
                i2 = (t2 * (47.59 / 41.65))
                print(f'{i2} доларів')

            else:
                print('я не знаю таку валюту 🫣')

        elif c == 'долар':
            k3 = input('введи у яку валюту ви хочете конвертувати долари (гривні 💶/євро 💵)\n').lower()
            t3 = int(input('введи суму доларів для конвертації 🤑\n'))
            if k3 == 'гривні':
                i3 = (t3 * 41.65)
                print(f'{i3} гривень')

            elif k3 == 'євро':
                i3 = (t3 * (41.65 / 47.59))
                print(f'{i3} євро')

            else:
                print('я не знаю таку валюту 🫣')

        elif c == 'вийти':
            break

        else:
            print('я не знаю таку валюту 🫣')



    except ValueError:
        print('введи число, а не текст 🫥😶‍🌫️')