import time

# ANSI-кольори для тексту
YELLOW = '\033[93m'
RESET = '\033[0m'

print('це програма, яка допоможе тобі зварити яйце, як ти хочеш 😉')

while True:
    try:
        user = int(input('як ти хочеш зварити яйце?\n 1 - з рідким жовтком 🍳 \n 2- з густим жовтком 🥚\n 3 - з синім жовтком 🔵\n 4 - вже не хочу нічо варити 😵\n '))

        if user == 1:
            print('запускаю таймер на 6 хв ⏱️. Коли пройде 6 хв - зможеш припиняти варити яйце 😉')
            seconds = 6 * 60

        elif user == 2:
            print('запускаю таймер на 9 хв ⏱️. Коли пройде 9 хв - зможеш припиняти варити яйце 😉')
            seconds = 9 * 60

        elif user == 3:
            print('запускаю таймер на 12 хв ⏱️. Коли пройде 12 хв - зможеш припиняти варити яйце 😉')
            seconds = 12 * 60

        elif user == 4:
            print('Тоді допобачення 👋🏻!')
            break

        else:
            print('схоже щось пішло не так 🫤, спробуй ще раз 😉')
            continue

        анімація = ['🍳', '🥚', '🔄', '⏳']

        for i in range(seconds, 0, -1):
            хв = i // 60
            сек = i % 60
            формат = f"{хв:02}:{сек:02}"  # наприклад, 05:23
            знак = анімація[i % len(анімація)]

            print(f"{YELLOW}Залишилось {формат} {знак}{RESET}")
            time.sleep(1)

        print(f"{YELLOW}ЧАС ВИЙШОВ! Можна діставати яйце 🥚🔥{RESET}\n")

    except ValueError:
        print('Вводь цифру опції, а не букви 😵')




#for i in range(seconds, 0, -1):
#            хв = i // 60
#            сек = i % 60
#            формат = f"{хв:02}:{сек:02}"
#            print(f"Залишилось {формат}")
#            time.sleep(1)