import time

print('це програма, яка допоможе тобі зварити яйце, як ти хочеш 😉')

while True:
    try:
        user = int(input('як ти хочеш зварити яйце?\n 1 - з рідким жовтком 🍳 \n 2 - з густим жовтком 🥚\n 3 - з синім жовтком 🔵\n 4 - вже не хочу нічо варити 😵\n '))

        if user == 1:
            print('запускаю таймер на 6 хв ⏱️. Коли пройде 6 хв - зможеш припиняти варити яйце 😉')
            minutes = 6



        elif user == 2:
            print('запускаю таймер на 9 хв ⏱️. Коли пройде 9 хв - зможеш припиняти варити яйце 😉')
            minutes = 9



        elif user == 3:
            print('запускаю таймер на 12 хв ⏱️. Коли пройде 12 хв - зможеш припиняти варити яйце 😉')
            minutes = 12


        elif user == 4:
            print('Тоді допобачення 👋🏻!')
            break


        elif user == 0:
            print('тестимо код 😉')
            minutes = 1


        else:
            print('схоже щось пішло не так 🫤, спробуй ще раз 😉')
            continue

        for m in range(minutes, 0, -1):
            print(f'Лишилося {m} хвилин...')
            time.sleep(60)

        print('ЧАС ВИЙШОВ! Можна діставати яйце 🥚🔥\n')

    except ValueError:
        print('Вводь цифру опції, а не букви 😵')