import random

sprobu = 0

r = int(random.randint(1,10))
# функція яка виводить рандомне число від a до b
print('Давай пограємо у гру. Я загадаю число від 1 до 10, а ти спробуєш відгадати його\n')

while True: #запускає нескінченний цикл.
    k = int(input('Введи своє число:\n '))
    sprobu += 1

    if k>r:
        print('я загадав менше число')
    elif k<r:
        print('Я загадав більше число')
    else:
        print('ти вгадав!!!')
        print(f'Ти вгадав за {sprobu} спроб(и)')
        break  # вихід з циклу, коли користувач вгадав
