film = ['планета мавп', 'університет монстрів', 'трансформери', 'монолог травниці']
print('Ось твій список фільмів/серіалів/мультфільмів:\n')
print(film)
k = int(input('Що ти хочеш зробити?\n 1- Додати якесь кіно\n 2- Видалити кіно зі списку\n 3-Переглянути список фільмів\n'))
if k == 1:
    t = input('Який фільм ви хочете додати?\n')
    film.append(t)
    print(film)
elif k == 2:
    t2 = input('Яке кіно ви хочете видалити?\n')
    film.remove(t2)
    print(film)
elif k == 3:
    print(film)
else:
    print('Ми не знаємо такої функції')
