print('****************************************')
print('|Вітаю у спрощеній програмі калькулятор|')
print('****************************************')

while True:
    k = int(input('яку математичну дію ти хочеш зробити?\n 1 - додавання;\n 2 - віднімання\n 3 - множення\n 4 - ділення\n 5 - вийти\n'))
    if k == 1:
        a = int(input('Введи перше число, яке ти хочеш додати\n'))
        b = int(input('Введи друге число, яке ти хочеш додати\n'))
        print(a + b)

    elif k == 2:
        a = int(input('Введи перше число, яке ти хочеш відняти\n'))
        b = int(input('Введи друге число, яке ти хочеш відняти\n'))
        print(a - b)

    elif k == 3:
        a = int(input('Введи перше число, яке ти хочеш помножити\n'))
        b = int(input('Введи друге число, яке ти хочеш помножити\n'))
        print(a * b)

    elif k == 4:
        a = int(input('Введи перше число, яке ти хочеш поділити\n'))
        b = int(input('Введи друге число, яке ти хочеш поділити\n'))
        print(a / b)

    elif k == 5:
        break

    else:
        print('Ми не знаємо такої математичної дії')
        break
